Tekla.Structures.DirectManipulation.Adapter.Native.dotBool
The Tekla.Structures.DirectManipulation.Adapter.Native.dotBool struct represents the boolean values as used in Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.True
Represents the boolean value true as used in Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.False
Represents the boolean value false as used in Tekla Structures.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.value
The numeric value of the boolean.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Native.dotBool struct.
The Tekla.Structures.DirectManipulation.Adapter.Native.dotBool struct represents the boolean values as used in Tekla Structures.
value: The value of the boolean.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Native.dotBool struct.
The Tekla.Structures.DirectManipulation.Adapter.Native.dotBool struct represents the boolean values as used in Tekla Structures.
value: The numeric value of the boolean.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.Value
Gets the numeric value of the boolean.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.IsFalse
Gets a value indicating whether the instance represents the Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.False value.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.IsTrue
Gets a value indicating whether the instance represents the Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.True value.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.op_Implicit(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)~System.Boolean
Provides an implicit conversion from Tekla.Structures.DirectManipulation.Adapter.Native.dotBool to System.Boolean.
value: A Tekla.Structures.DirectManipulation.Adapter.Native.dotBool value to convert.
Returns: A matching System.Boolean value.

Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.op_Implicit(System.Boolean)~Tekla.Structures.DirectManipulation.Adapter.Native.dotBool
Provides an implicit conversion from Tekla.Structures.DirectManipulation.Adapter.Native.dotBool to Tekla.Structures.DirectManipulation.Adapter.Native.dotBool.
value: A System.Boolean value to convert.
Returns: A matching Tekla.Structures.DirectManipulation.Adapter.Native.dotBool value.